In [1]:
import pandas

from data_algebra.data_ops import *
from data_algebra.arrow import *
import data_algebra.SQLite

In [2]:
td = TableDescription(
  "d", 
  ["col1", "col2", "col3"])

In [3]:
ops = td. \
    extend({'sum23': 'col2 + col3'}). \
    select_columns(['sum23'])

In [4]:
ops

TableDescription(
 table_name='d',
 column_names=[
   'col1', 'col2', 'col3']) .\
   extend({
    'sum23': 'col2 + col3'}) .\
   select_columns(['sum23'])

In [5]:
ops.columns_used()

{'d': {'col2', 'col3'}}

In [6]:
db_model = data_algebra.SQLite.SQLiteModel()

print(ops.to_sql(db_model=db_model, pretty=True))

SELECT "sum23"
FROM
  (SELECT "col2" + "col3" AS "sum23"
   FROM ("d") "SQ_0") "SQ_1"

In [7]:
d = pandas.DataFrame({
    'col1': [1], 
    'col2': [2], 
    'col3': [3]
})

In [8]:
d

   col1  col2  col3
0     1     2     3

In [9]:
ops.transform(d)

   sum23
0      5

In [10]:
ops = td. \
    extend({'sum23': 'col2 + col3'}). \
    select_columns(['sum23']). \
    extend({'x': 1}). \
    extend({'x': 2}). \
    extend({'x': 3}). \
    extend({'x': 4}). \
    extend({'x': 5}). \
    select_columns(['sum23'])

ops

TableDescription(
 table_name='d',
 column_names=[
   'col1', 'col2', 'col3']) .\
   extend({
    'sum23': 'col2 + col3'}) .\
   select_columns(['sum23']) .\
   extend({
    'x': '5'}) .\
   select_columns(['sum23'])

In [11]:
try:
    ops_bad = td. \
      extend({'sum23': 'col2_MISSPELLED + col3'})
except NameError as ne:
    print('caught exception: ' + str(ne))

caught exception: name 'col2_MISSPELLED' is not defined

In [12]:
print(ops.to_sql(db_model=db_model, pretty=True))

SELECT "sum23"
FROM
  (SELECT "sum23"
   FROM
     (SELECT "col2" + "col3" AS "sum23"
      FROM ("d") "SQ_0") "SQ_1") "SQ_2"